# Задание 3
# Показать на экран таблицу умножения в диапазоне,
# указанном пользователем. Например, если пользователь
# указал 3 и 5, таблица может выглядеть так
# 3*1 = 3 3*2 = 6 3*3 = 9 ... 3 * 10 = 30
# .....................................................................................
# 5*1 = 5 5 *2 = 10 5 *3 = 15 ... 5 * 10 = 50

a = int(input())
b = int(input())

start = min(a,b)
end = max(a,b)


for n in range(start, end+1):
    for i in range(1,11):
        print(f"{n} * {i} = {n * i}", end=' ') 
    print()        